app/helpers/application_helper.rb

  def liked_post?(subject, type)
    liked = Like.where(user_id: current_user.id, post_id: subject.id).exists? if type == 'post'
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]