app/views/posts/_timeline.html.erb

      <div id='comment_div'>
        <% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]