app/views/posts/index.html.erb

          <button class="btn btn-warning">Unlike </button>
          <button class="btn btn-success">Like  <%= post.likes.count %></button>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]

      <div id='comment_div'>
        <% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]