app/views/posts/index.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <span class="icon">
        <% post_like = p.likes.find { |like| like.user_id == current_user.id} %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
---
      </span>
      <p><%= p.likes.count %> <%= (p.likes.count) == 1 ? 'Like' : 'Likes'%></p>