app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:comment][:post_id])
    @comments = @post.comments
    @comment = @post.comments.build(comment_params)
    if @comment.save
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post_id", 5], ["content", "good post"], ["created_at", "2020-02-10 17:42:00.909200"], ["updated_at", "2020-02-10 17:42:00.909200"]]

  def set_post
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]