app/controllers/friendships_controller.rb

  def create
    current_user.friendships.create(friend_id: params[:friend_id], status: false)
---
INSERT INTO "friendships" ("status", "user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["status", false], ["user_id", 1], ["friend_id", 2], ["created_at", "2020-02-19 00:37:52.821173"], ["updated_at", "2020-02-19 00:37:52.821173"]]

  def update
    @friendship ||= current_user.received_requests.find_by(user_id: params[:id])
    @friendship.update_attribute(:status, true)
    Friendship.create!(friend_id: @friendship.user_id, user_id: @friendship.friend_id, status: true)
---
UPDATE "friendships" SET "status" = $1, "updated_at" = $2 WHERE "friendships"."id" = $3  [["status", true], ["updated_at", "2020-02-25 23:18:49.555480"], ["id", 7]]
INSERT INTO "friendships" ("user_id", "friend_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["friend_id", 1], ["status", true], ["created_at", "2020-02-25 23:18:49.610805"], ["updated_at", "2020-02-25 23:18:49.610805"]]

  def destroy
    @friendship = current_user.received_requests.find_by(user_id: params[:id])
    redirect_back(fallback_location: root_path) if @friendship.delete
---
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 3]]