app/controllers/likes_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("likable_type", "likable_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likable_type", "Post"], ["likable_id", 1], ["created_at", "2020-02-10 18:47:41.082773"], ["updated_at", "2020-02-10 18:47:41.082773"], ["user_id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "likes" ("likable_type", "likable_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likable_type", "Post"], ["likable_id", 3], ["created_at", "2020-02-10 19:05:12.625253"], ["updated_at", "2020-02-10 19:05:12.625253"], ["user_id", 2]]
---
  def create
    if already_liked?
      destroy
    else
      if params.include? 'comment_id'
        @comment = Comment.find(params[:comment_id])
        @comment.likes.create(user_id: current_user.id)
      elsif params.include? 'post_id'
        @post = Post.find(params[:post_id])
        @post.likes.create(user_id: current_user.id)

SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."likable_id" = $2 LIMIT $3  [["user_id", 2], ["likable_id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."likable_id" = $2 LIMIT $3  [["user_id", 1], ["likable_id", 1], ["LIMIT", 1]]
---
  def already_liked?
    if params.include? 'post_id'
      Like.where(user_id: current_user.id, likable_id: params[:post_id]).exists?
    elsif params.include? 'comment_id'
      Like.where(user_id: current_user.id, likable_id: params[:comment_id]).exists?

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 3]]
---
  def destroy
    @like = find_like
    @like&.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def find_like
    if params.include? 'post_id'
      @post = Post.find(params[:post_id])