app/controllers/posts_controller.rb

  def index
    @posts = current_user.posts
    current_user.friends.each { |friend| @posts = @posts.or(friend.posts) }
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 2]]

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.valid?
      @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "eroiurehgregf"], ["created_at", "2020-02-19 20:15:23.460859"], ["updated_at", "2020-02-19 20:15:23.460859"], ["user_id", 1]]

  def update
    @post = Post.find_by(id: params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "test three foure"], ["updated_at", "2020-02-10 18:49:48.332789"], ["id", 2]]

  def destroy
    @post = Post.find_by(id: params[:id])
    if @post.comments.empty?
      @post.delete
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT $2  [["post_id", 15], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 15]]