app/controllers/posts_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @posts = Post.all.order(created_at: :DESC)
    @users = User.all